app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "content", "stars", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Article 1CP"], ["content", "Essaie 1"], ["stars", 5], ["created_at", "2018-06-04 15:29:12.405963"], ["updated_at", "2018-06-04 15:29:12.405963"], ["user_id", 2]]
---
  def create
    @article = Article.new(article_params)
    @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["content", "je suis fière de toi t'as bien bossé !"], ["updated_at", "2018-05-30 15:53:01.268391"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(article_params)